Tekla Open API Reference for Tekla Structures 2025
Picker.PickThreePoints Method
 Requests a pick of three points from the user.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void PickThreePoints(
	string firstPrompt,
	string secondPrompt,
	string thirdPrompt,
	out Point firstPickedPoint,
	out Point secondPickedPoint,
	out Point thirdPickedPoint,
	out ViewBase pickedView
)
Public Sub PickThreePoints (
	firstPrompt As String,
	secondPrompt As String,
	thirdPrompt As String,
	<OutAttribute> ByRef firstPickedPoint As Point,
	<OutAttribute> ByRef secondPickedPoint As Point,
	<OutAttribute> ByRef thirdPickedPoint As Point,
	<OutAttribute> ByRef pickedView As ViewBase
)
Parameters
firstPrompt
Type: System.String
The prompt shown in the status bar before the first pick. See the class remarks for more information about prompts.
secondPrompt
Type: System.String
The prompt shown in the status bar before the second pick. See the class remarks for more information about prompts.
thirdPrompt
Type: System.String
The prompt shown in the status bar before the third pick. See the class remarks for more information about prompts.
firstPickedPoint
Type: Tekla.Structures.Geometry3d.Point
The first picked point in the view coordinates.
secondPickedPoint
Type: Tekla.Structures.Geometry3d.Point
The second picked point in the view coordinates.
thirdPickedPoint
Type: Tekla.Structures.Geometry3d.Point
The third picked point in the view coordinates.
pickedView
Type: Tekla.Structures.Drawing.ViewBase
The view in which the pick occurred.
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace